name: "ObjectPoseRecognitionCNN"
layer {
  name: "data"
  type: "TripleImageData"
  top: "data"
  image_data_param {
    # source: "./object_pose_recognition/data/file_list.txt"
    source: "./object_pose_recognition/data/trainingData_New_cvl_triple.txt"
    batch_size: 12
    new_height: 64
    new_width: 64
  }
  transform_param {
	scale: 0.00390625
	mean_file: "./object_pose_recognition/data/oprnew_mean.binaryproto"
	mirror: 1
  }
}
layer {
  name: "data_p"
  type: "PairImageData"
  top: "data_p"
  image_data_param {
    # source: "./object_pose_recognition/data/file_list_p.txt"
    source: "./object_pose_recognition/data/trainingData_New_cvl_pair.txt"
    batch_size: 12
    new_height: 64
    new_width: 64
  }
  transform_param {
	scale: 0.00390625
	mean_file: "./object_pose_recognition/data/oprnew_mean.binaryproto"
	mirror: 1
  }
}
layer {
    name: "slicer_label"
    type: "Slice"
    bottom: "data"
    top: "data_a"
    top: "data_b"
    top: "data_c"
    slice_param {
        axis: 1
        slice_point: 3
        slice_point: 6
    }
}
layer {
    name: "slicer_label_p"
    type: "Slice"
    bottom: "data_p"
    top: "data_a_p"
    top: "data_b_p"
    slice_param {
        axis: 1
        slice_point: 3
    }
}
layer{
	name: "conv1"
	type: "Convolution"
	bottom: "data_a"
	bottom: "data_b"
	bottom: "data_c"
	bottom: "data_a_p"
	bottom: "data_b_p"
	top: "conv1_a"
	top: "conv1_b"
	top: "conv1_c"
	top: "conv1_a_p"
	top: "conv1_b_p"
    	param {
        	lr_mult: 1
    	}
    	param {
        	lr_mult: 2
    	}
	convolution_param {
		num_output: 16
		kernel_size: 9
		stride: 1
		weight_filler {
      			type: "xavier"
    		}
    		bias_filler {
      			type: "constant"
    		}
	}
}
layer{
	name: "relu1_a"
	type: "ReLU"
	bottom: "conv1_a"
	top: "conv1_a"
}


layer{
        name: "relu1_b"
        type: "ReLU"
        bottom: "conv1_b"
        top: "conv1_b"
}
layer{
        name: "relu1_c"
        type: "ReLU"
        bottom: "conv1_c"
        top: "conv1_c"
}
layer{
	name: "relu1_a_p"
	type: "ReLU"
	bottom: "conv1_a_p"
	top: "conv1_a_p"
}


layer{
        name: "relu1_b_p"
        type: "ReLU"
        bottom: "conv1_b_p"
        top: "conv1_b_p"
}
layer{
	name: "pool1_a"
	type: "Pooling"
	bottom: "conv1_a"
	top: "pool1_a"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride : 2
	}	
}
layer{
	name: "pool1_b"
	type: "Pooling"
	bottom: "conv1_b"
	top: "pool1_b"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride : 2
	}	
}
layer{
	name: "pool1_c"
	type: "Pooling"
	bottom: "conv1_c"
	top: "pool1_c"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride : 2
	}	
}
layer{
	name: "pool1_a_p"
	type: "Pooling"
	bottom: "conv1_a_p"
	top: "pool1_a_p"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride : 2
	}	
}
layer{
	name: "pool1_b_p"
	type: "Pooling"
	bottom: "conv1_b_p"
	top: "pool1_b_p"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride : 2
	}	
}
layer{
	name: "conv2"
	type: "Convolution"
	bottom: "pool1_a"
	bottom: "pool1_b"
	bottom: "pool1_c"
	bottom: "pool1_a_p"
	bottom: "pool1_b_p"
	top: "conv2_a"
	top: "conv2_b"
	top: "conv2_c"
	top: "conv2_a_p"
	top: "conv2_b_p"
    	param {
        	lr_mult: 1
   	}
    	param {
        	lr_mult: 2
    	}
	convolution_param {
		num_output: 7
		kernel_size: 5
		stride: 1
		weight_filler {
      			type: "xavier"
    		}
    		bias_filler {
      			type: "constant"
    		}
	}
}
layer{
	name: "relu2_a"
	type: "ReLU"
	bottom: "conv2_a"
	top: "conv2_a"
}
layer{
        name: "relu2_b"
        type: "ReLU"
        bottom: "conv2_b"
        top: "conv2_b"
}
layer{
        name: "relu2_c"
        type: "ReLU"
        bottom: "conv2_c"
        top: "conv2_c"
}
layer{
	name: "relu2_a_p"
	type: "ReLU"
	bottom: "conv2_a_p"
	top: "conv2_a_p"
}
layer{
        name: "relu2_b_p"
        type: "ReLU"
        bottom: "conv2_b_p"
        top: "conv2_b_p"
}
layer{
	name: "pool2_a"
	type: "Pooling"
	bottom: "conv2_a"
	top: "pool2_a"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride : 2
	}	
}
layer{
	name: "pool2_b"
	type: "Pooling"
	bottom: "conv2_b"
	top: "pool2_b"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride : 2
	}	
}
layer{
	name: "pool2_c"
	type: "Pooling"
	bottom: "conv2_c"
	top: "pool2_c"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride : 2
	}	
}
layer{
	name: "pool2_a_p"
	type: "Pooling"
	bottom: "conv2_a_p"
	top: "pool2_a_p"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride : 2
	}	
}
layer{
	name: "pool2_b_p"
	type: "Pooling"
	bottom: "conv2_b_p"
	top: "pool2_b_p"
	pooling_param {
		pool: MAX
		kernel_size: 2
		stride : 2
	}	
}
layer{
		name: "ip3_a"
		type: "InnerProduct"
		bottom: "pool2_a"
		top: "ip3_a"
		param {
			name: "ip3_w"
    		lr_mult: 1
		}
		param {
				name: "ip3_bi"
				lr_mult: 2
		}
		inner_product_param {
				num_output: 256
				weight_filler {
					type: "xavier"
				}
				bias_filler {
				  type: "constant"
			}

  	}
}
layer{
        name: "ip3_b"
        type: "InnerProduct"
        bottom: "pool2_b"
        top: "ip3_b"
		param {
			name: "ip3_w"
    		lr_mult: 1
		}
		param {
				name: "ip3_bi"
				lr_mult: 2
		}
		inner_product_param {
				num_output: 256
				weight_filler {
					type: "xavier"
				}
				bias_filler {
				  type: "constant"
			}

  	}
}
layer{
        name: "ip3_c"
        type: "InnerProduct"
        bottom: "pool2_c"
        top: "ip3_c"
        param {
			name: "ip3_w"
    		lr_mult: 1
		}
		param {
				name: "ip3_bi"
				lr_mult: 2
		}
  	inner_product_param {
    		num_output: 256
    		weight_filler {
      			type: "xavier"
    		}
    		bias_filler {
		      type: "constant"
		}

  	}
}
layer{
	name: "ip3_a_p"
	type: "InnerProduct"
	bottom: "pool2_a_p"
	top: "ip3_a_p"
	param {
			name: "ip3_w"
    		lr_mult: 1
		}
		param {
				name: "ip3_bi"
				lr_mult: 2
		}
  	inner_product_param {
    		num_output: 256
    		weight_filler {
      			type: "xavier"
    		}
    		bias_filler {
		      type: "constant"
		}

  	}
}
layer{
        name: "ip3_b_p"
        type: "InnerProduct"
        bottom: "pool2_b_p"
        top: "ip3_b_p"
        param {
			name: "ip3_w"
    		lr_mult: 1
		}
		param {
				name: "ip3_bi"
				lr_mult: 2
		}
  	inner_product_param {
    		num_output: 256
    		weight_filler {
      			type: "xavier"
    		}
    		bias_filler {
		      type: "constant"
		}

  	}
}
layer{
	name: "relu3_a"
	type: "ReLU"
	bottom: "ip3_a"
	top: "ip3_a"
}
layer{
        name: "relu3_b"
        type: "ReLU"
        bottom: "ip3_b"
        top: "ip3_b"
}
layer{
        name: "relu3_c"
        type: "ReLU"
        bottom: "ip3_c"
        top: "ip3_c"
}
layer{
	name: "relu3_a_p"
	type: "ReLU"
	bottom: "ip3_a_p"
	top: "ip3_a_p"
}
layer{
        name: "relu3_b_p"
        type: "ReLU"
        bottom: "ip3_b_p"
        top: "ip3_b_p"
}
layer{
	name: "ip4_a"
	type: "InnerProduct"
	bottom: "ip3_a"
	top: "ip4_a"
	param {
		name: "ip4_w"
    	lr_mult: 1
	}
	param {
		name: "ip4_bi"
		lr_mult: 2
	}
  	inner_product_param {
    		num_output: 16
    		weight_filler {
      			type: "xavier"
    		}
    		bias_filler {
		      type: "constant"
		}

  	}
}
layer{
        name: "ip4_b"
        type: "InnerProduct"
        bottom: "ip3_b"
        top: "ip4_b"
        param {
		name: "ip4_w"
    	lr_mult: 1
		}
		param {
			name: "ip4_bi"
			lr_mult: 2
		}
  	inner_product_param {
    		num_output: 16
    		weight_filler {
      			type: "xavier"
    		}
    		bias_filler {
		      type: "constant"
		}

  	}
}
layer{
        name: "ip4_c"
        type: "InnerProduct"
        bottom: "ip3_c"
        top: "ip4_c"
        param {
		name: "ip4_w"
    	lr_mult: 1
		}
		param {
			name: "ip4_bi"
			lr_mult: 2
		}
  	inner_product_param {
    		num_output: 16
    		weight_filler {
      			type: "xavier"
    		}
    		bias_filler {
		      type: "constant"
		}

  	}
}
layer{
	name: "ip4_a_p"
	type: "InnerProduct"
	bottom: "ip3_a_p"
	top: "ip4_a_p"
	param {
		name: "ip4_w"
    	lr_mult: 1
	}
	param {
		name: "ip4_bi"
		lr_mult: 2
	}
  	inner_product_param {
    		num_output: 16
    		weight_filler {
      			type: "xavier"
    		}
    		bias_filler {
		      type: "constant"
		}

  	}
}
layer{
        name: "ip4_b_p"
        type: "InnerProduct"
        bottom: "ip3_b_p"
        top: "ip4_b_p"
	param {
		name: "ip4_w"
    	lr_mult: 1
	}
	param {
		name: "ip4_bi"
		lr_mult: 2
	}
  	inner_product_param {
    		num_output: 16
    		weight_filler {
      			type: "xavier"
    		}
    		bias_filler {
		      type: "constant"
		}

  	}
}
layer {
	name: "loss"
	type: "TriplePairEuclideanLoss"
	bottom: "ip4_a"
	bottom: "ip4_b"
	bottom: "ip4_c"
	bottom: "ip4_a_p"
	bottom: "ip4_b_p"
	top: "loss"
}
