name: "ObjectPoseRecognitionCNN"
layer {
  name: "data"
  type: "ImageData"
  top: "data"
  top: "label"
  image_data_param {
 	source: "./object_pose_recognition/data/file_list.txt"
    batch_size: 64
    new_height: 64
    new_width: 64
  }
  #transform_param {
  #  mean_file: "./examples/cifar10/mean.binaryproto"
  #}
}
layer{
	name: "conv1"
	type: "Convolution"
	bottom: "data"
	top: "conv1"
	convolution_param {
		num_output: 16
		kernel_size: 8
		stride: 2
	}
}
layer{
	name: "relu1"
	type: "ReLU"
	bottom: "conv1"
	top: "conv1"
	
}
layer{
	name: "pool1"
	type: "Pooling"
	bottom: "conv1"
	top: "pool1"
	pooling_param {
		pool: MAX
		kernel_size: 2
	}	
}
layer{
	name: "conv2"
	type: "Convolution"
	bottom: "pool1"
	top: "conv2"
	convolution_param {
		num_output: 7
		kernel_size: 5
		pad: 1
		stride: 2
	}
}
layer{
	name: "relu2"
	type: "ReLU"
	bottom: "conv2"
	top: "conv2"
	
}
layer{
	name: "pool2"
	type: "Pooling"
	bottom: "conv2"
	top: "pool2"
	pooling_param {
		pool: MAX
		kernel_size: 2
	}	
}
layer{
	name: "ip3"
	type: "InnerProduct"
	bottom: "pool2"
	top: "ip3"
	inner_product_param {
		num_output: 256
	}
}
layer{
	name: "relu3"
	type: "ReLU"
	bottom: "ip3"
	top: "ip3"
}
layer{
	name: "ip4"
	type: "InnerProduct"
	bottom: "ip3"
	top: "ip4"
	inner_product_param {
		num_output: 256 # descriptor size ?
	}
}
layer {
	name: "loss"
	type: "SoftmaxWithLoss"
	bottom: "ip4"
	bottom: "label"
	top: "loss"
}
